"""
Завдання №8. Ви розробляєте програму для автосалону, яка обробляє інформацію про різні автомобілі. У вас є
базовий абстрактний клас Car (автомобіль), який містить загальну інформацію про автомобіль, таку як марка та модель.
У додаткових класах, які успадковують від Car, ви розширюєте функціональність для конкретних типів автомобілів.

1. Клас Sedan (седан) успадковує від Car. Він має додатковий атрибут - кількість дверей.
2. Клас SUV успадковує від Car. Він має додатковий атрибут - кількість пасажирських місць.
3. Клас SportsCar (спортивний автомобіль) успадковує від Car. Він має додатковий атрибут - максимальна швидкість.

Створіть об'єкти різних класів (седан, позашляховик, спортивний автомобіль) і використовуйте їх функціонал.
Виведіть інформацію про кожен автомобіль, включаючи загальну інформацію з Car та специфічну інформацію для
кожного класу."""

