"""
Завдання №3. Розробіть клас "Car", який містить такі властивості: make (марка автомобіля),
model (модель автомобіля), year (рік випуску автомобіля) і mileage (пробіг автомобіля). Забезпечте
можливість доступу до цих властивостей через методи, а також зробіть властивості "make" і "model" приватними.

Додайте метод "drive" до класу "Car", який збільшує пробіг автомобіля на задане значення. Перевірте, чи не
перевищує пробіг заданий ліміт (наприклад, 300 000 км), і виведіть повідомлення про досягнення ліміту при
спробі здійснити поїздку."""

