"""
Завдання №6. Ви розробляєте програму для інформації про тварин в зоопарку. У вас є базовий клас Animal (тварина),
який містить загальну інформацію про тварину, таку як назва та вид. У додаткових класах, які успадковують
від Animal, ви розширюєте функціональність для конкретних видів тварин.

1. Клас Mammal (ссавець) успадковує від Animal. Він має додатковий атрибут - тип харчування
(наприклад, травоїдний, всеїдний, хижий).
2. Клас Carnivore (хижак) успадковує від Mammal. Він має додатковий атрибут - кількість зубів.
3. Клас Lion (лев) успадковує від Carnivore. Він має додатковий атрибут - розмір гриви.

Створіть об'єкти різних класів (лев, хижак, ссавець) і використовуйте їх функціонал. Виведіть інформацію про
кожну тварину, включаючи загальну інформацію з Animal та специфічну інформацію для кожного класу."""

