
# Завдання №2. Створіть функцію, яка приймає два числа від користувача та обробляє помилку,
# якщо введені дані не є числами.

def is_numbers():
    """ Функція приймає два числа та оброблює помилки """
    try:
        number_1 = int(input("Введи перше число: "))
        print("Введено число")
    except ValueError:
        print("Не є числом", "\n")

    try:
        number_2 = int(input("Введи друге число: "))
        print("Введено число")
    except ValueError:
        print("Не є числом", "\n")


is_numbers()
