
# Завдання №13. Напишіть програму, яка просить користувача відгадати секретне число від 1 до 10.
# Програма повинна продовжувати запитувати відповіді до тих пір, поки користувач не вгадає правильно.
# Якщо користувач вводить 0, програма повинна завершити роботу і вивести "Наступного разу пощастить!".

import random
random_number = random.randint(1, 10)
print("Відгадай число від 1 до 10")
while True:
    input_number = int(input("Твоє число: "))
    if input_number == 0:
        print("Наступного разу пощастить!")
        break
    elif input_number == random_number:
        print("Так, ти вгадав!")
        break
    else:
        print("Спробуй ще раз", "\n")
