
# Завдання №11. Напишіть програму, яка знаходить другий найменший елемент у списку.
# Використовувати функцію min заборонено.

list_1 = [12, 23, 7, 18, 87, 34, 5, 34, 2, 54]
list_1.sort()
result = list_1[1]
print(f"Друге найменше число зі списку: {result}")


# ----------------------------------------------
#
# """ Підраховує найменше число із списку """
#
# list_1 = [12, 23, 7, 18, 87, 34, 5, 34, 2, 54]
# result = 0
# for number in list_1:
#     if result == 0 or number < result:
#         result = number
# print(f"Найменше число зі списку: {result}")
