
# Напишіть програму, яка отримує рядок з консолі. Програма повинна виводити частоту слів у порядку спадання,
# показуючи спочатку найчастотніші слова. Крім того, програма повинна ігнорувати звичайні слова
# (відомі як стоп-слова), такі як "і", "та", "ні", "або" тощо.

"""
1. Прочитайте рядок з консолі та збережіть його вміст у рядковій змінній.
2. Створіть список стоп-слів, що містить загальновживані слова, які ви хочете ігнорувати під час підрахунку частоти слів
3. Розділіть текст на окремі слова за допомогою методу split. Видаліть зі слів початкові та кінцеві розділові знаки.
4. Створіть словник для зберігання частот слів, де слова будуть ключами, а їхні частоти - значеннями.
5. Перебирайте список слів та оновлюйте частоти у словнику.
6. Перевірте, чи є слово стоп-словом. Якщо так, пропустіть його.
7. Якщо слова немає у словнику, додайте його як ключ з частотою 1.
8. Якщо слово вже є у словнику, збільшити його частоту на 1.
9. Відсортуйте словник за значеннями у порядку спадання, щоб спочатку отримати найчастотніші слова.
10. Виведіть результати частоти слів.
"""


def function_1():
    """ Функція дає можливість вводити необмежену кількість рядків """
    strings = ""

    while True:
        next_string = input()
        if next_string == "":
            break
        strings += next_string + "\n"

    return strings


def function_2(strings: str):
    """ Функція прибирає усі розділові знаки та переводить слова до нижнього регістру"""
    from re import split

    delimiters = "[,.;!? \n]"
    split_string = split(delimiters, strings)
    new_string = " ".join(split_string).lower().strip().split()

    return new_string


def function_3(words: list):
    """ Функція додає до словника слова ігноруючи слова "і", "та", "ні", "або", та рахує кількість слів у словнику """
    new_dict = {}
    ignor_words = ["і", "та", "ні", "або"]

    for word in words:
        if word in ignor_words:
            continue
        else:
            new_dict[word] = new_dict.get(word, 0) + 1

    sorted_dict = dict(sorted(new_dict.items(), key=lambda item: item[1], reverse=True))
    return sorted_dict


print("Введіть рядки, наприклад вірш:")
print("(Для завершення вводу натисніть Enter двічі)")
print(function_3(function_2(function_1())))
